app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", "5"], ["created_at", "2017-06-12 21:06:01.862596"], ["updated_at", "2017-06-12 21:06:01.862596"]]
---
def create
  @school_class = SchoolClass.new(post_params)
  @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", "10"], ["updated_at", "2017-06-12 21:12:23.956124"], ["id", 1]]
---
def update
  @school_class = SchoolClass.find(params[:id])
  @school_class.update(post_params)